---
kind: property
id: P:Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintFlecksSize
source: html/f3244177-995d-b956-cd0a-a655687bea98.htm
---
# Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintFlecksSize Property

The property labeled "Size" from the "MetallicPaint" schema.

## Syntax (C#)
```csharp
public static string MetallicpaintFlecksSize { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 1".